set_property SRC_FILE_INFO {cfile:{C:/Users/jains/OneDrive - UC San Diego/research/IFAT6/IFAT6_PCB/Verilog/IFAT6_PCB/IFAT6_PCB.srcs/constrs_1/imports/pcb_ok_xem7310/ifat6_XEM7310-A200.xdc} rfile:../../../IFAT6_PCB.srcs/constrs_1/imports/pcb_ok_xem7310/ifat6_XEM7310-A200.xdc id:1} [current_design]
set_property src_info {type:XDC file:1 line:3 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W11 [get_ports sys_clkp]
set_property src_info {type:XDC file:1 line:4 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W12 [get_ports sys_clkn]
set_property src_info {type:XDC file:1 line:89 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN T5 [get_ports PROBE_CLK_ADC]
set_property src_info {type:XDC file:1 line:97 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN U5 [get_ports PROBE_CLK_DAC]
set_property src_info {type:XDC file:1 line:108 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN R4 [get_ports PROBE_CLK_300M]
set_property src_info {type:XDC file:1 line:158 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB8 [get_ports ADC_SDO]
set_property src_info {type:XDC file:1 line:170 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN V3 [get_ports ROW_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:178 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W1 [get_ports COL_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:192 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y1 [get_ports SHIFT_REG_D]
set_property src_info {type:XDC file:1 line:200 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB3 [get_ports INPUT_DATA_ACK]
set_property src_info {type:XDC file:1 line:206 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB2 [get_ports INPUT_DATA_REQ]
set_property src_info {type:XDC file:1 line:214 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y13 [get_ports DAC2_SYNCb]
set_property src_info {type:XDC file:1 line:222 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AA14 [get_ports DAC_SCLK]
set_property src_info {type:XDC file:1 line:227 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB16 [get_ports DAC3_LDACb]
set_property src_info {type:XDC file:1 line:232 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AA13 [get_ports DAC2_SDI]
set_property src_info {type:XDC file:1 line:237 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB17 [get_ports DAC3_SYNCb]
set_property src_info {type:XDC file:1 line:242 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB13 [get_ports DAC2_CLRb]
set_property src_info {type:XDC file:1 line:247 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AA15 [get_ports DAC3_SDI]
set_property src_info {type:XDC file:1 line:252 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W15 [get_ports DAC5_CLRb]
set_property src_info {type:XDC file:1 line:257 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AB15 [get_ports DAC3_CLRb]
set_property src_info {type:XDC file:1 line:262 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W16 [get_ports DAC5_LDACb]
set_property src_info {type:XDC file:1 line:267 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y16 [get_ports DAC2_LDACb]
set_property src_info {type:XDC file:1 line:272 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN AA16 [get_ports DAC5_SDI]
set_property src_info {type:XDC file:1 line:331 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P5 [get_ports INPUT_DATA0]
set_property src_info {type:XDC file:1 line:336 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P6 [get_ports ASYNC_RST]
set_property src_info {type:XDC file:1 line:341 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P4 [get_ports INPUT_DATA1]
set_property src_info {type:XDC file:1 line:346 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N5 [get_ports SHIFT_REG_SET]
set_property src_info {type:XDC file:1 line:351 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N4 [get_ports INPUT_DATA2]
set_property src_info {type:XDC file:1 line:356 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P2 [get_ports ARRAY_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:361 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N3 [get_ports INPUT_DATA3]
set_property src_info {type:XDC file:1 line:366 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N2 [get_ports OUTPUT_DATA13]
set_property src_info {type:XDC file:1 line:369 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN L5 [get_ports INPUT_DATA4]
set_property src_info {type:XDC file:1 line:374 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN R1 [get_ports OUTPUT_DATA12]
set_property src_info {type:XDC file:1 line:377 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN L4 [get_ports INPUT_DATA5]
set_property src_info {type:XDC file:1 line:382 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P1 [get_ports OUTPUT_DATA11]
set_property src_info {type:XDC file:1 line:385 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M6 [get_ports INPUT_DATA6]
set_property src_info {type:XDC file:1 line:390 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M3 [get_ports OUTPUT_DATA10]
set_property src_info {type:XDC file:1 line:393 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M5 [get_ports INPUT_DATA7]
set_property src_info {type:XDC file:1 line:398 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M2 [get_ports OUTPUT_DATA9]
set_property src_info {type:XDC file:1 line:401 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M1 [get_ports INPUT_DATA8]
set_property src_info {type:XDC file:1 line:406 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K6 [get_ports OUTPUT_DATA8]
set_property src_info {type:XDC file:1 line:409 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN L1 [get_ports INPUT_DATA9]
set_property src_info {type:XDC file:1 line:414 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J6 [get_ports OUTPUT_DATA7]
set_property src_info {type:XDC file:1 line:423 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K2 [get_ports INPUT_DATA10]
set_property src_info {type:XDC file:1 line:428 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN L3 [get_ports OUTPUT_DATA6]
set_property src_info {type:XDC file:1 line:431 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J2 [get_ports INPUT_DATA11]
set_property src_info {type:XDC file:1 line:436 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K3 [get_ports OUTPUT_DATA5]
set_property src_info {type:XDC file:1 line:439 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K1 [get_ports INPUT_DATA12]
set_property src_info {type:XDC file:1 line:444 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J5 [get_ports resetIFAT]
set_property src_info {type:XDC file:1 line:449 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J1 [get_ports INPUT_DATA13]
set_property src_info {type:XDC file:1 line:454 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN H5 [get_ports _setLFSR]
set_property src_info {type:XDC file:1 line:459 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN H3 [get_ports INPUT_DATA14]
set_property src_info {type:XDC file:1 line:464 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN H2 [get_ports PULSE_GEN_RST]
set_property src_info {type:XDC file:1 line:469 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN G3 [get_ports INPUT_DATA15]
set_property src_info {type:XDC file:1 line:474 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN G2 [get_ports OUTPUT_DATA_ACK]
set_property src_info {type:XDC file:1 line:479 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN E2 [get_ports INPUT_DATA16]
set_property src_info {type:XDC file:1 line:484 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN G1 [get_ports OUTPUT_DATA_REQ]
set_property src_info {type:XDC file:1 line:487 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN D2 [get_ports INPUT_DATA17]
set_property src_info {type:XDC file:1 line:492 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN F1 [get_ports OUTPUT_DATA0]
set_property src_info {type:XDC file:1 line:495 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN F3 [get_ports INPUT_DATA18]
set_property src_info {type:XDC file:1 line:500 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN E1 [get_ports OUTPUT_DATA1]
set_property src_info {type:XDC file:1 line:509 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN E3 [get_ports INPUT_DATA19]
set_property src_info {type:XDC file:1 line:514 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN D1 [get_ports OUTPUT_DATA2]
set_property src_info {type:XDC file:1 line:517 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN B1 [get_ports INPUT_DATA20]
set_property src_info {type:XDC file:1 line:522 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN C2 [get_ports OUTPUT_DATA3]
set_property src_info {type:XDC file:1 line:525 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN A1 [get_ports INPUT_DATA21]
set_property src_info {type:XDC file:1 line:530 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN B2 [get_ports OUTPUT_DATA4]
set_property src_info {type:XDC file:1 line:533 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K4 [get_ports INPUT_DATA22]
set_property src_info {type:XDC file:1 line:538 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN U15 [get_ports DAC5_SYNCb]
set_property src_info {type:XDC file:1 line:543 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J4 [get_ports INPUT_DATA23]
set_property src_info {type:XDC file:1 line:548 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN V15 [get_ports DAC4_LDACb]
set_property src_info {type:XDC file:1 line:553 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN T16 [get_ports ADC_SDI]
set_property src_info {type:XDC file:1 line:558 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN T14 [get_ports DAC4_SYNCb]
set_property src_info {type:XDC file:1 line:563 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN U16 [get_ports ADC_SCLK]
set_property src_info {type:XDC file:1 line:568 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN T15 [get_ports DAC4_SDI]
set_property src_info {type:XDC file:1 line:573 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN V13 [get_ports ADC_CSb]
set_property src_info {type:XDC file:1 line:578 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN W14 [get_ports DAC4_CLRb]
set_property src_info {type:XDC file:1 line:583 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN V14 [get_ports DAC1_SDI]
set_property src_info {type:XDC file:1 line:588 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y14 [get_ports DAC1_SYNCb]
set_property src_info {type:XDC file:1 line:593 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y11 [get_ports DAC1_CLRb]
set_property src_info {type:XDC file:1 line:598 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN Y12 [get_ports DAC1_LDACb]
set_property src_info {type:XDC file:1 line:747 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports COL_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:748 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports COL_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:749 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC1_CLRb]
set_property src_info {type:XDC file:1 line:750 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC1_CLRb]
set_property src_info {type:XDC file:1 line:751 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC1_LDACb]
set_property src_info {type:XDC file:1 line:752 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC1_LDACb]
set_property src_info {type:XDC file:1 line:753 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC2_CLRb]
set_property src_info {type:XDC file:1 line:754 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC2_CLRb]
set_property src_info {type:XDC file:1 line:755 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC2_LDACb]
set_property src_info {type:XDC file:1 line:756 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC2_LDACb]
set_property src_info {type:XDC file:1 line:757 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC3_CLRb]
set_property src_info {type:XDC file:1 line:758 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC3_CLRb]
set_property src_info {type:XDC file:1 line:759 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC3_LDACb]
set_property src_info {type:XDC file:1 line:760 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC3_LDACb]
set_property src_info {type:XDC file:1 line:761 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC4_CLRb]
set_property src_info {type:XDC file:1 line:762 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC4_CLRb]
set_property src_info {type:XDC file:1 line:763 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC4_LDACb]
set_property src_info {type:XDC file:1 line:764 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC4_LDACb]
set_property src_info {type:XDC file:1 line:765 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC5_CLRb]
set_property src_info {type:XDC file:1 line:766 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC5_CLRb]
set_property src_info {type:XDC file:1 line:767 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports DAC5_LDACb]
set_property src_info {type:XDC file:1 line:768 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports DAC5_LDACb]
set_property src_info {type:XDC file:1 line:769 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports INPUT_DATA0]
set_property src_info {type:XDC file:1 line:770 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports INPUT_DATA0]
set_property src_info {type:XDC file:1 line:771 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports INPUT_DATA1]
set_property src_info {type:XDC file:1 line:772 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports INPUT_DATA1]
set_property src_info {type:XDC file:1 line:773 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports INPUT_DATA2]
set_property src_info {type:XDC file:1 line:774 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports INPUT_DATA2]
set_property src_info {type:XDC file:1 line:775 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports INPUT_DATA3]
set_property src_info {type:XDC file:1 line:776 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports INPUT_DATA3]
set_property src_info {type:XDC file:1 line:777 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.100 [get_ports ROW_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:778 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.300 [get_ports ROW_SHIFT_REG_CLK]
set_property src_info {type:XDC file:1 line:779 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -0.500 [get_ports okAA]
set_property src_info {type:XDC file:1 line:780 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 2.000 [get_ports okAA]
set_property src_info {type:XDC file:1 line:786 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_ports okAA] -to [get_pins OK_IFAT6/inst/okHI/core0/core0/a0/c0/la64fa2d1faaafafc73d47ae32e7cfc88_reg/D] 12.500
set_property src_info {type:XDC file:1 line:789 export:INPUT save:INPUT read:READ} [current_design]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins OK_IFAT6/inst/okHI/mmcm0/CLKOUT0]] -group [get_clocks VIRTUAL_clk_out1_clk_wiz_0]
set_property src_info {type:XDC file:1 line:793 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -3.500 [get_ports DAC1_SDI]
set_property src_info {type:XDC file:1 line:794 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 7.500 [get_ports DAC1_SDI]
set_property src_info {type:XDC file:1 line:798 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins Data_Converter_Clocks/inst/mmcm_adv_inst/CLKOUT0] -to [get_ports DAC1_SYNCb] 16.000
set_property src_info {type:XDC file:1 line:800 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:801 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:802 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[2]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:803 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[3]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:804 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:805 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:806 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[6]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:807 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[7]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:808 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[8]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:809 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:810 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[10]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:811 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[11]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:812 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:813 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[13]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:814 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[14]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:815 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[15]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:816 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[16]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:817 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[17]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:818 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:819 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[19]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:820 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[20]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:821 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[21]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:822 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:823 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:824 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[24]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:825 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[25]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:826 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:827 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:828 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[28]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:829 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[29]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:830 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]_replica/C}]] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:831 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[31]/C}] -to [get_ports DAC1_SDI] 20.000
set_property src_info {type:XDC file:1 line:835 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -3.500 [get_ports DAC2_SDI]
set_property src_info {type:XDC file:1 line:836 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 7.500 [get_ports DAC2_SDI]
set_property src_info {type:XDC file:1 line:840 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins Data_Converter_Clocks/inst/mmcm_adv_inst/CLKOUT0] -to [get_ports DAC2_SYNCb] 16.000
set_property src_info {type:XDC file:1 line:842 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]_replica/C}]] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:843 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:844 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[2]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:845 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[3]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:846 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:847 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]_replica/C}]] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:848 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[6]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:849 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[7]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:850 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[8]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:851 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:852 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[10]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:853 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[11]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:854 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:855 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[13]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:856 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[14]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:857 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[15]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:858 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[16]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:859 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[17]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:860 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:861 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[19]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:862 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[20]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:863 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[21]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:864 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:865 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:866 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[24]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:867 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[25]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:868 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:869 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:870 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[28]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:871 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[29]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:872 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:873 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[31]/C}] -to [get_ports DAC2_SDI] 20.000
set_property src_info {type:XDC file:1 line:877 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -3.500 [get_ports DAC3_SDI]
set_property src_info {type:XDC file:1 line:878 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 7.500 [get_ports DAC3_SDI]
set_property src_info {type:XDC file:1 line:882 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins Data_Converter_Clocks/inst/mmcm_adv_inst/CLKOUT0] -to [get_ports DAC3_SYNCb] 16.000
set_property src_info {type:XDC file:1 line:884 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]_replica/C}]] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:885 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:886 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[2]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:887 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[3]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:888 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:889 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:890 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[6]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:891 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[7]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:892 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[8]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:893 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:894 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[10]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:895 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[11]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:896 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:897 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[13]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:898 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[14]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:899 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[15]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:900 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[16]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:901 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[17]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:902 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:903 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[19]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:904 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[20]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:905 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[21]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:906 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]_replica/C}]] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:907 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:908 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[24]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:909 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[25]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:910 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:911 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:912 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[28]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:913 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[29]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:914 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:915 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[31]/C}] -to [get_ports DAC3_SDI] 20.000
set_property src_info {type:XDC file:1 line:919 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -3.500 [get_ports DAC4_SDI]
set_property src_info {type:XDC file:1 line:920 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 7.500 [get_ports DAC4_SDI]
set_property src_info {type:XDC file:1 line:924 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins Data_Converter_Clocks/inst/mmcm_adv_inst/CLKOUT0] -to [get_ports DAC4_SYNCb] 16.000
set_property src_info {type:XDC file:1 line:926 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]_replica/C}]] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:927 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:928 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[2]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:929 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[3]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:930 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:931 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:932 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[6]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:933 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[7]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:934 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[8]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:935 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:936 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[10]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:937 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[11]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:938 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:939 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[13]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:940 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[14]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:941 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[15]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:942 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[16]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:943 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[17]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:944 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:945 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[19]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:946 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[20]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:947 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[21]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:948 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]_replica/C}]] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:949 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]_replica/C}]] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:950 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[24]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:951 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[25]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:952 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:953 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [list [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]/C}] [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]_replica/C}]] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:954 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[28]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:955 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[29]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:956 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:957 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[31]/C}] -to [get_ports DAC4_SDI] 20.000
set_property src_info {type:XDC file:1 line:961 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -min -add_delay -3.500 [get_ports DAC5_SDI]
set_property src_info {type:XDC file:1 line:962 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks okUH0] -max -add_delay 7.500 [get_ports DAC5_SDI]
set_property src_info {type:XDC file:1 line:966 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins Data_Converter_Clocks/inst/mmcm_adv_inst/CLKOUT0] -to [get_ports DAC5_SYNCb] 16.000
set_property src_info {type:XDC file:1 line:968 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[0]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:969 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[1]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:970 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[2]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:971 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[3]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:972 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[4]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:973 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[5]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:974 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[6]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:975 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[7]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:976 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[8]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:977 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[9]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:978 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[10]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:979 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[11]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:980 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[12]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:981 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[13]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:982 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[14]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:983 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[15]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:984 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[16]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:985 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[17]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:986 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[18]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:987 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[19]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:988 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[20]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:989 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[21]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:990 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[22]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:991 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[23]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:992 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[24]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:993 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[25]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:994 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[26]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:995 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[27]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:996 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[28]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:997 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[29]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:998 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[30]/C}] -to [get_ports DAC5_SDI] 20.000
set_property src_info {type:XDC file:1 line:999 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_pins {OK_IFAT6/inst/wi01/ep_dataout_reg[31]/C}] -to [get_ports DAC5_SDI] 20.000
